app/Controllers/Blog.php

    public function detail($id)
    {
        $postModel = new \App\Models\PostModel();
        $post = $this->postModel->find($id);
---
SELECT *
FROM `posts`
WHERE `posts`.`id` = '3'

    public function category($category)
    {
        $postModel = new \App\Models\PostModel();

        $data['posts'] = $postModel
            ->where('category', $category)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `posts`
WHERE `category` = 'Politik'
ORDER BY `created_at` DESC