app/Views/blog.php

SELECT DISTINCT `category`
FROM `posts`
---

        <?php
        $PostModel = new PostModel();
        $categories = $PostModel->distinct()->select('category')->findAll();