app/Views/detail_blog.php

SELECT *
FROM `posts`
WHERE `posts`.`id` = '3'
---
                  <?php
                  use App\Models\PostModel;
                  $PostModel = new PostModel();
                  $post = $PostModel->find($post['id']);